-----------------------------------------------------------------------
--
-- Main
--
-----------------------------------------------------------------------

-----------------------------------------------------------------------
-- 1. 조기경보후보선정항목 데이터 클린징 및 고객구분 세팅
-----------------------------------------------------------------------
-----------------------------------------------------------
-- 고객구분이 하나이며 '1' 고객번호는 잘못된 것으로 삭제
-----------------------------------------------------------
delete from cor.조기경보후보선정항목
where 고객번호 in (
      select 고객번호
      from
         (select 고객번호,
                 MAX(DECODE(고객구분,'1','1',NULL)) 구분1,
                 MAX(DECODE(고객구분,'2','2',NULL)) 구분2,
                 MAX(DECODE(고객구분,'3','3',NULL)) 구분3,
                 MAX(DECODE(고객구분,'4','4',NULL)) 구분4,
                 MAX(DECODE(고객구분,'5','5',NULL)) 구분5,
                 MAX(DECODE(고객구분,'A','A',NULL)) 구분A,
                 MAX(DECODE(고객구분,'B','B',NULL)) 구분B,
                 MAX(DECODE(고객구분,'C','C',NULL)) 구분C,
                 MAX(DECODE(고객구분,'F','F',NULL)) 구분F,
          	     count(*) cnt
          from  (select 고객번호,고객구분 from cor.여신고객
                 where 기관코드 = '1'
                 and   고객번호 in (select distinct 고객번호 from cor.조기경보후보선정항목)
                 )
          group by 고객번호
          )
      where cnt = 1
      and   (구분1 = '1' or 구분4 = '4' or 구분B = 'B' or 구분F = 'F') --순수개인,외국인(개인)
      )
;

commit;

-----------------------------------------------------------
-- 여신고객에 존재하지 않은 후보업체고객 삭제
-----------------------------------------------------------
delete from cor.조기경보후보선정항목
where  고객번호 in
       (select distinct 고객번호 from cor.조기경보후보선정항목
        minus
        select distinct 고객번호 from cor.여신고객
        where  기관코드 = '1'
        and    고객번호 in (select distinct 고객번호 from cor.조기경보후보선정항목)
       )
;

----------------------------------------------------------------------------
-- 2. 조기경보스크린대상업체 클린고객번호와 고객구분만 만 남기고 모두 삭제
----------------------------------------------------------------------------
delete from cor.조기경보스크린대상업체
where  고객번호 not in (select distinct 고객번호 from cor.조기경보후보선정항목)
;

-----------------------------------------------------------------------
--  클린고객번호 고객구분 세팅
-----------------------------------------------------------------------
update cor.조기경보스크린대상업체 a
set    (a.고객구분) =
       (select (CASE WHEN 구분2 = '2' THEN '2'
                ELSE CASE WHEN 구분3 = '3' THEN '3'
                    ELSE CASE WHEN 구분C = 'C' THEN 'C'
                         ELSE CASE WHEN 구분5 = '5' THEN '5'
                              ELSE ' ' END
                         END
                    END
                END) 고객구분
        from
           (select 고객번호,
                   MAX(DECODE(고객구분,'1','1',' ')) 구분1,
                   MAX(DECODE(고객구분,'2','2',' ')) 구분2,
                   MAX(DECODE(고객구분,'3','3',' ')) 구분3,
                   MAX(DECODE(고객구분,'4','4',' ')) 구분4,
                   MAX(DECODE(고객구분,'5','5',' ')) 구분5,
                   MAX(DECODE(고객구분,'A','A',' ')) 구분A,
                   MAX(DECODE(고객구분,'B','B',' ')) 구분B,
                   MAX(DECODE(고객구분,'C','C',' ')) 구분C,
                   MAX(DECODE(고객구분,'F','F',' ')) 구분F,
                   count(*) cnt
            from  (select 고객번호,고객구분 from cor.여신고객
                   where 기관코드 = '1'
                   and   고객번호 in (select distinct 고객번호 from cor.조기경보후보선정항목)
                   )
            group by 고객번호
            )
        where 고객번호 = a.고객번호
       )
;


-------------------------------------------------------------------------------------
-- 3. 조기경보선정 및 조기경보지도주의관찰기업 및 조기경보해제승인 및 조기경보해제
--    클린고객번호가 아닌 고객 모두 삭제
-------------------------------------------------------------------------------------
--------------------------
-- 추가. 2004.11.02
--------------------------
delete from cor.조기경보점검항목
where  고객번호 in
      (select 고객번호 from cor.조기경보점검항목
       minus
       SELECT 고객번호 FROM COR.조기경보스크린대상업체
       WHERE  순여신한도 >= 500000000
       AND    제외업체여부 = 'N')
;

delete from cor.조기경보선정
where  고객번호 in
      (select 고객번호 from cor.조기경보선정
       minus
       select 고객번호 from cor.조기경보후보선정항목)
;

delete from cor.조기경보지도주의관찰기업
where  고객번호 in
      (select 고객번호 from cor.조기경보지도주의관찰기업
       minus
       select 고객번호 from cor.조기경보후보선정항목)
;

delete from cor.조기경보해제승인
where  고객번호 in
      (select 고객번호 from cor.조기경보해제승인
       minus
       select 고객번호 from cor.조기경보후보선정항목)
;

delete from cor.조기경보해제
where  고객번호 in
      (select 고객번호 from cor.조기경보해제
       minus
       select 고객번호 from cor.조기경보후보선정항목)
;

commit;
